Repository: QGEP/QGEP-Documentation
Catalog: i18n/*/admin-guide.po
Languages: de

source: Data export
de: Datenexport

source: This represents a guide on how to export data from QGEP.
de: Eine Anleitung zum Export von Daten aus QGEP.

source: Export formats
de: Exportierformate

source: INTERLIS (in progress)
de: INTERLIS (in Bearbeitung)

source: dxf (in progress)
de: dxf (In Bearbeitung)

source: Shape
de: Form

source: MOUSE / MikeUrban
de: Maus / MikeUrban

source: other
de: andere

source: INTERLIS Export can be done using the ili2pg tool. For further information contact the developer team.
de: Der INTERLIS Export kann mit dem ili2pg Wekzeug ausgeführt werden. Für weitere Informationen, kontaktieren Sie das Entwicklungsteam.

source: Data import
de: Datenimport

source: This represents a guide on how to import data from QGEP.
de: Eine Anleitung zum Import von Daten aus QGEP

source: Import formats
de: Importierformate

source: INTERLIS Import can be done using the ili2pg tool. For further information contact the developer team.
de: Der INTERLIS Import kann mit dem ili2pg Wekzeug ausgeführt werden. Für weitere Informationen, kontaktieren Sie das Entwicklungsteam

source: Admin Guide
de: Administratorhandbuch

source: This represents a guide on how to administrate the database, install a Virtual machine, import and export data
de: Eine Anleitung zur Administration der Datenbank, zum Installieren einer virtuellen Maschine und zum Import und Export von Dateien

source: PgAdminIII is a Desktop tool that permits to access and manage the database server. This chapter represents a guide on how to do basic PostgreSQL management using pgAdmin.
de: PgAdminIII ist eine Desktopapplikation die es erlaubt auf den Datenbankserver zuzugreifen. Dieses Kapitel beinhaltet einen Leitfaden zum Thema PostgreSQL Datenmanagement mit pgAdmin.

source: Install pgAdmin
de: Installation von pgAdmin

source: pgAdmin should be automatically installed if you used the EnterpriseDB installer.
de: pgAdmin sollte automatisch installiert werden wenn Sie den EnterpriseDB installer verwendet haben.

source: Debian/Ubuntu based distros
de: Debian/Ubuntu basierte Distributionen

source: You can install pgAdmin by running the following command:
de: Sie können pgAdmin installieren durch Eingabe von folgendem Befehl:

source: Fedora based distros
de: Fedora basierte Distributionen

source: Suse based distros
de: Suse basierte Distributionen

source: All the commands presented above assume that you are logged in as a user with sudo (admin) privileges. On certain systems it may be required to use the command ``su`` to become the *root* user and then issue the above command without the ``sudo`` prefix.
de: Die oben vorgestellten Befehle setzen voraus, dass Sie als Benutzer mit sudo (administrativ) Rechten eingeloggt sind. Auf gewissen Systemen kann es notwendig sein den Befehl ``su`` einzugeben um *root* Benutzer zu werden. Dann können Sie obige Befehle ohne das Präfix ``sudo`` ausführen.

source: Using Pgadmin
de: PgAdmin verwenden

source: SQL query
de: SQL Abfrage

source: **Running SQL commands in PgAdminIII**
de: **SQL Befehle in PgAdminIII ausführen**

source: Clicking the highlighted icon at location *1* opens the SQL Window. The SQL icon is active only when you're connected to a database.
de: Wenn Sie das markierte Symbol *1* anklicken öffnet dies das SQL Fenster. Das SQL Symbol ist nur aktiv, wenn Sie mit einer Datenbank verbunden sind.

source: Clicking the icon at *2* runs the written SQL commands.
de: Ein Klick auf *2* führt den eingetippten SQL Befehl aus.

source: Database dump
de: Datenbank Speicherauszug

source: Open pgAdminIII and connect to the database
de: Öffnen Sie pgAdminIII und verbinden Sie sich mit der Datenbank

source: Right click the Schema that you want to backup (in the tree structure below "Schemas")
de: Rechtsklicken Sie das Schema, welches Sie sichern wollen (in der Baumstruktur unter "Schemas")

source: Enter the filename where the dump should be stored
de: Geben Sie den Orndernamen ein, unter welchem der Speicherauszug abgespeichert werden soll

source: Check the following options
de: Überprüfen Sie die folgenden Optionen

source: After running the process, the exit code 0 indicates that everything went ok
de: Nachdem Sie der Prozess abgeschlossen ist, zeigt der Ausgangscode 0, dass alles gut gegangen ist
